restFul/v2/gmarket/xmls/add_item.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <EncTicket xmlns="http://tpl.gmarket.co.kr/">
            <encTicket>
            </encTicket>
        </EncTicket>
    </soap:Header>
    <soap:Body>
        <AddItem xmlns="http://tpl.gmarket.co.kr/">
            <AddItem>
                <ReferencePrice xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
                <Refusal xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
                <ItemImage xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
                <As xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
                <Shipping xmlns="http://tpl.gmarket.co.kr/tpl.xsd">
                    <NewItemShipping />
                </Shipping>
                <BundleOrder xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
                <OrderLimit xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
                <Origin xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
                <GoodsKind xmlns="http://tpl.gmarket.co.kr/tpl.xsd"/>
            </AddItem>
        </AddItem>
    </soap:Body>
</soap:Envelope>